tap "homebrew/cask-fonts"
brew "anyenv"
brew "autoconf"
brew "awscli"
brew "bat"
brew "cmake"
brew "coreutils"
brew "fd"
brew "fzf"
brew "gh"
brew "ghq"
brew "giflib"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "grep"
brew "grpcurl"
brew "jpeg"
brew "jq"
brew "libpng"
brew "mas"
brew "protobuf"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "wget"
brew "xz"
brew "zsh"
brew "eza"
cask "font-hack-nerd-font"
cask "visual-studio-code"
