# tap "adoptopenjdk/openjdk"
tap "cjbassi/ytop"
tap "CQLabs/dcm"
# tap "convco/formulae"
# tap "ethereum/ethereum"
# tap "extrawurst/tap"
tap "github/gh"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "spring-io/tap"
tap "hashicorp/tap"
tap "leoafarias/fvm"
tap "aws/tap"
tap "azure/functions"
# tap "wix/brew"
cask_args appdir: "/Applications"

brew "asdf"
## wix
# brew "applesimutils"
## Network Wathing
# brew "bandwhich"
brew "bat"
brew "cmake"
brew "wget"
# brew "convco"
brew "coreutils"
brew "curl"
brew "go"
brew "sqlite"
brew "iproute2mac"
# brew "dcm"
## For Rust
# brew "dust"
# brew "ethereum" 

## Make if colorul for Terminal 
brew "exa"
cask "iterm2"

cask "spotify"
cask "clipy"
## enhance find-command
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "git-cliff"
brew "git-delta"
brew "git-gui"
brew "grep"
brew "htop"
brew "hyperfine"
## 何に使うかわからん
# brew "ios-deploy"
brew "jupyterlab"
brew "jq"
brew "cloc"
brew "ghq"
brew "anyenv"
brew "peco"
brew "hub"
brew "graphviz"
brew "plantuml"
## For Go
# brew "lf"

## A simple command line interface for the Mac App Store. Designed for scripting and automation.
brew "mas"
## ターミナルで動作するディスク使用量調査ツール
brew "ncdu"
brew "nushell"
brew "nvim"
## enhance npm/yarn
brew "pnpm"
## プロセス表示・検索ツール
brew "procs"
brew "ripgrep"
brew "ruby"
brew "spring-io/tap/spring-boot"
# brew "rust-analyzer"
brew "terraform"
brew "awscli"
brew "aws-sam-cli"
brew "serverless"
brew "redis"
# Rosetta にて個別にインストールする
# brew "azure-functions-core-tools@4"
# brew "azure-cli"
## search & displace cli 
brew "sd"
## Terminal 便利検索
brew "sk"
## For yabai
brew "skhd"
brew "starship"
brew "poetry"
brew "stow"

## man コミュニティー駆動
brew "tealdeer"
brew "tmux"
brew "tokei"
brew "watchman"
brew "yabai"
brew "ytop"
brew "zola"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "yqrashawn/goku/goku"

## https://github.com/Automattic/node-canvas
brew "pkg-config"

## 複数の出力デバイスをサポートする2Dグラフィックライブラリ
# brew "cairo"
# brew "pango"
brew "pgloader"
brew "mdcat"
brew "hdf5"
brew "nmap"
brew "libpng"
brew "jpeg"
brew "giflib"
brew "librsvg"
brew "tree"
brew "postgresql"
cask "pgadmin4"
brew "mysql"
brew "jenkins-lts"
brew "gradle"
brew "openssl"
brew "git-secrets"
brew "xpdf"
brew "autoconf"
brew "automake"    
brew "libtool"
brew "pkg-config"
brew "gcc"
brew "gperf"
brew "texinfo"
brew "yasm"
brew "nasm"
brew "bison"
brew "autogen"
brew "gettext"
brew "meson"
brew "ninja"
brew "mitmproxy"

# Successfully `flutter doctor` 
# Have to Open Android Studio App and Install Components
# Then, More Action > SDK Manager > Android SDK > SDK Tools 
# Check > [ ] Android SDK Build-Tools xx  [ ] Android SDK Command-line Tools(latest)
# Run Command `flutter doctor --android-licenses` On Terminal
# cask "flutter"
brew "fvm"
brew "trash"
# Android Studio SetUp
cask "android-file-transfer"
brew "scrcpy"
cask "android-studio"
cask "android-platform-tools"

cask "background-music"
cask "telegram"
cask "calibre"
brew "cocoapods"
brew "llvm"
brew "yt-dlp"
brew "subversion"
cask "figma"
cask "raycast"
cask "insomnia"
cask "bitwarden"
cask "protonvpn"
# brew uninstall --cask blender
cask "the-unarchiver"
cask "gitkraken"
cask "webtorrent"
cask "adobe-acrobat-reader"
# cask "adoptopenjdk/openjdk/adoptopenjdk11"

cask "blackhole-16ch"
# cask "blender"
cask "vivaldi"
cask "firefox"
# cask "brave-browser"
cask "discord"
cask "docker"
cask "dbeaver-community"
cask "figma"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "brave-browser"
cask "google-cloud-sdk"
cask "timemachineeditor"
# cask "google-japanese-ime"
cask "gpg-suite"
## APIを確認する用のクライアント
cask "insomnia"
cask "slack-cli"
## Easily manage your crypto
# cask "ledger-live"
cask "notion"
cask 'drawio'
cask "dropbox"
cask "alfred"
cask "postman"
## for video recording and live streaming
# cask "obs"
# cask "obs-ndi"
cask "recut"
cask "signal"
cask "slack"
# cask "xmind"
# https://youtu.be/d8plJSJYqVw?t=808
# https://matthewpalmer.net/rocket/
cask "rocket"
cask "google-japanese-ime"
## mac　で ubuntu / windows / raspbian
cask "utm"
cask "visual-studio-code"
# cask "zoom"
cask "sourcetree"
cask "karabiner-elements"
cask "alacritty"
cask "obsidian"
cask "todoist"
cask "microsoft-office"
cask "intellij-idea-ce"
cask "webstorm"
cask "pycharm-ce"
cask "sublime-text"
cask "anaconda"
cask "timemachineeditor"
# mas "Bitwarden", id: 1137397744 # this didn't work. manually installed instead.
#mas "Final Cut Pro", id: 424389933
# mas "Vimari", id: 1480933944
# mas "Xcode", id: 497799835
mas "NAS Navigator2", id: 450664466
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "Microsoft Remote Desktop", id: 1295203466
mas "Skitch", id: 425955336
